{
  "products": [
    {
      "name": "iphone 12",
      "desc": "Apple iPhone 12 — ультрамощный смартфон от престижного бренда. Девайс получил молниеносный процессор A14 Bionic и впечатляющий дисплей Super Retina XDR от края до края. Набор продвинутых камер эффективно работает даже в условиях слабого освещения. Видеоролики Dolby Vision завораживают реалистичностью. Фотовозможности гаджета колоссальны. Широкоугольный датчик теперь улавливает значительно больше света. Проработка нюансов очень точная днем и ночью. Портретный режим обеспечивает художественное размытие фона, выделяя самое главное. Смартфон объединяет прорывные возможности с легендарным дизайном. Apple iPhone 12 это выбор активного пользователя.",
      "price": "75000",
      "image": "https://avatars.mds.yandex.net/get-mpic/5163819/img_id8902755056279263478.png/orig",
      "storage": "64",
      "color": "blue",
      "id": 1
    },
    {
      "name": "Iphone 13",
      "desc": "Наша самая совершенная система двух камер. Особый взгляд на прочность дисплея. Чип, с которым всё супербыстро. Аккумулятор держится заметно дольше. iPhone 13 - сильный мира всего. Мы разработали совершенно новую схему расположения и развернули объективы на 45 градусов. Благодаря этому внутри корпуса поместилась наша лучшая система двух камер с увеличенной матрицей широкоугольной камеры. Кроме того, мы освободили место для системы оптической стабилизации изображения сдвигом матрицы. И повысили скорость работы матрицы на сверхширокоугольной камере. Новая сверхширокоугольная камера видит больше деталей в тёмных областях снимков. Новая широкоугольная камера улавливает на 47% больше света для более качественных фотографий и видео. Новая оптическая стабилизация со сдвигом матрицы обеспечит чёткие кадры даже в неустойчивом положении. Режим «Киноэффект» автоматически добавляет великолепные эффекты перемещения фокуса и изменения резкости. Просто начните запись видео. Режим «Киноэффект» будет удерживать фокус на объекте съёмки, создавая красивый эффект размытия вокруг него. Режим «Киноэффект» распознаёт, когда нужно перевести фокус на другого человека или объект, который появился в кадре. Теперь ваши видео будут смотреться как настоящее кино. Хотите переместить фокус или добавить эффект художественного размытия по окончании съёмки? Не проблема. С iPhone для этого достаточно нескольких касаний. На такое способны даже не все профессиональные кинокамеры. Дисплей OLED стал на 28% ярче — до 800 кд/﻿м². На нём всё хорошо видно даже в самый солнечный день. А яркость при просмотре контента в HDR достигает 1200 кд/﻿м². Вы сможете различить мельчайшие оттенки чёрного и белого — как и всех остальных цветов. При этом дисплей расходует заряд аккумулятора ещё более экономно, чем прежде. Дисплей Super Retina XDR отличается невероятно высокой плотностью пикселей — фотографии, видео и текст выглядят поразительно чётко. А благодаря уменьшенной площади камеры TrueDepth на дисплее теперь больше места для изображения. iPhone 13 работает от аккумулятора до 2,5 часов дольше. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, невероятно надёжной технологии аутентификации. Сверхбыстрый чип A15 Bionic обеспечивает работу режима «Киноэффект», фотографических стилей и других функций. Secure Enclave защищает персональные данные, в том числе Face ID и контакты. А ещё новый чип увеличивает время работы от аккумулятора. Скорость работы процессора до 50% выше, чем у многих других смартфонов Обработка графики до 30% быстрее, чем у многих других смартфонов.",
      "price": 91000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5251502/img_id6904501887217302707.jpeg/orig",
      "storage": "128",
      "color": "blue",
      "id": 2
    },
    {
      "name": "Iphone 12 pro max",
      "desc": "Apple iPhone 12 Pro Max — бескомпромиссный и престижный смартфон. Возможности гаджета восхищают. Ультрабыстрый процессор A14 Bionic заставляет игры «летать». Огромный дисплей Super Retina XDR привлекает «живой» картинкой. Система Pro-камер удивляет реалистичными видео Dolby Vision. Всеобщий ночной режим впечатляет качеством фотографий, снятых при недостатке света. Вернулся дизайн, полюбившийся миллионам фанатов бренда. Передовые характеристики сочетаются здесь с легендарной i-классикой. Монолитный корпус гаджета сделан из закаленного стекла и хирургической стали. Панель Ceramic Shield обеспечивает новый уровень защиты дисплея. Рамки уменьшились, а экран увеличился. Apple iPhone 12 Pro Max — выбор динамичных людей, следящих за развитием технологий.",
      "price": 139000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5256693/img_id6696909390469808896.png/orig",
      "storage": "256",
      "color": "white",
      "id": 3
    },
    {
      "name": "Xiaomi redmi note 10",
      "desc": "Xiaomi Redmi Note 10 - это флагманский уровень доступного смартфона Redmi. Яркий AMOLED-экран, быстро заряжаемая батарея, новая камера с записью видео 4К, процессор Qualcomm Snapdragon 678 и многие другие преимущества способны убедить вас на покупку этого смартфона. Глаз не нарадуется AMOLED-экран размером 6,43 дюйма с пиковой яркостью 1100 нит, цветовым охватом DCI-P3, сертификатом «Eye Care Display», а также полноценной функцией Always On-Display сделает просмотр и пользование контентом на вашем смартфоне по-новому комфортным и приятным для глаз. Сколько камер на кучу эмоций Redmi 10 оснащён системой из 4 объективов: широкоугольной, ультраширокоугольная, макрокамерой и датчиком глубины. Все четыре камеры работают на базе ИИ и готовы к съёмкам самых захватывающих и ярких снимков в любых ситуациях. Производительность на высоком уровне Redmi Note 10 оснащён передовым процессором Qualcomm, которого в купе вместе с объёмом оперативной памяти с лихвой хватит на любые повседневные активности. С платформой на базе Android 11 можно также полноценно пользоваться всеми повседневными приложениями, забыв про какие-либо задержки и подвисания. Заряжен на сутки работы с легкостью позволит вам работать, связываться и играть в различные игры на протяжении всего дня без перерыва. С помощью быстрой зарядки вы всегда сможете при необходимости оперативно пополнить заряд батареи и вернуться к работе или в игру",
      "price": "27000",
      "image": "https://avatars.mds.yandex.net/get-mpic/4732637/img_id4202309359210132757.jpeg/orig",
      "storage": "32",
      "color": "black",
      "id": 4
    },
    {
      "name": "Iphone 11",
      "desc": "Функциональный и стильный смартфон Apple iPhone 11 в металлическом корпусе способен обеспечить не только повседневное общение и развлечения, но и продуктивную работу. Для этого он оснащен мощным процессором Apple A13 Bionic из 6 ядер, поддерживающим слаженную работу всех комплектующих, а также модулем ОЗУ объемом в 4 ГБ, что предусматривает быстрое переключение между открытыми приложениями и возможность играть в игры. Основная (12;12 Мп) и фронтальная (12 Мп) камеры позволят создавать фотошедевры. Изображение на экране смартфона Apple iPhone 11 диагональю 6.1 дюйма обладает поразительной детализацией и цветопередачей. Олеофобное покрытие исключает сильное загрязнение экрана. Корпус смартфона имеет высокую степень пылевлагозащиты (IP68), благодаря чему обеспечивается эффективная и длительная работа устройства. Несъемный аккумулятор емкостью 3110 мА·ч поддерживает беспроводную зарядку, что сделает данный процесс более легким и быстрым.",
      "price": 59000,
      "image": "https://avatars.mds.yandex.net/get-mpic/4397006/img_id3884474343356692179.jpeg/orig",
      "storage": "64",
      "color": "white",
      "id": 5
    },
    {
      "name": "Iphone XS",
      "desc": "iPhone XS оснащён HDR‑дисплеем Super Retina с диагональю 5,8 дюйма. Панели OLED обеспечивают наилучшую цветопередачу, глубокие чёрные цвета и впечатляющую яркость. С улучшенной технологией FaceID можно безопасно разблокировать iPhone, входить в учётные записи приложений и оплачивать покупки буквально одним взглядом. Процессор A12 Bionic с системой Neural Engine нового поколения использует технологии машинного обучения и открывает невероятные возможности для фотографии, игр, дополненной реальности и многого другого. А потрясающая двойная камера 12 Мп с режимом «Портрет», функцией портретного освещения, улучшенным эффектом боке и совершенно новой функцией «Глубина» позволяет взглянуть на портретную съёмку по‑новому.",
      "price": 50000,
      "image": "https://avatars.mds.yandex.net/get-mpic/3927509/img_id1460411555123294267.jpeg/orig",
      "storage": "64",
      "color": "black",
      "id": 6
    },
    {
      "name": "Asus ROG Phone 3",
      "desc": "Asus ROG Phone 3 — супермощный игровой смартфон. Процессор Snapdragon 865 Plus обеспечивает высокую частоту смены кадров. Скоростной дисплей AMOLED молниеносно откликается на касания. Триггеры AirTrigger 3 повышают комфорт при гемплее, а батарея 6 000 мАч гарантирует высокую автономность. Динамики дополняют события сочным стереофоническим звуком. Светящийся логотип добавляет устройству шарма. Трехкамерная система выдает четкие фотографии при любых условиях съемки. Основной сенсор — 64 Мп фирмы Sony. Используется сверхширокоугольный 125-градусный объектив. Гаджет фиксирует видео 8K. Передняя 24 Мп камера отлично справляется с автопортретами и 4K селфи-роликами. Снимки оптимизирует нейросеть. Стильный Asus ROG Phone 3 расширяет горизонты мобильного гейминга.",
      "price": 40000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5296089/img_id4486099360822180143.jpeg/orig",
      "storage": "256",
      "color": "black",
      "id": 7
    },
    {
      "name": "Xiaomi Redmi Note 9",
      "desc": "Xiaomi Redmi Note 9 (NFC) — очень выносливый телефон с квадрокамерой. Гаджет вооружен отличным аккумулятором и четким 48 Мп сенсором. Накопитель здесь расширяется через отдельный слот. Вы сможете устанавливать 2 SIM-карты и параллельно наращивать память. Сканер на задней крышке моментально разблокирует аппарат, обеспечивая сохранность данных. Хороший вибромотор создает приятный тактильный отклик. Модуль бесконтактной оплаты — еще один козырь гаджета. Вы сможете платить за покупки непосредственно с телефона, оставляя бумажник дома. Это удобно и современно. Владельцы NFC-телефонов обычно не носят собой лишний груз. Xiaomi Redmi Note 9 (NFC) — большой смартфон с внушительной батареей. Это сильный игрок в среднем классе.",
      "price": 21000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5253050/img_id9119548998774695677.jpeg/orig",
      "storage": "64",
      "color": "blue",
      "id": 8
    },
    {
      "name": "samsung galaxy J5",
      "desc": "Samsung Galaxy J5 с HD экраном на 5,2 дюйма имеет гладкий металлический корпус. Телефон комфортно лежит в руке благодаря отсутствию выступа камеры. Основная камера имеет разрешение в 13 Мп, что позволяет делать чёткие снимки даже при плохом освещении. У смартфона предусмотрено 2 Гб оперативной и 16 Гб встроенной памяти, которую можно увеличить до 256 Гб с помощью карты microSD. Смартфон Samsung Galaxy J5 оснащён технологией NFC для совершения бесконтактных платежей.",
      "price": 15000,
      "image": "https://avatars.mds.yandex.net/get-mpic/364668/img_id5594640453029554891/orig",
      "storage": "16",
      "color": "black",
      "id": 9
    },
    {
      "name": "ZTE Blade L9",
      "desc": "Наличие большого 5-дюймого дисплея с разрешением 960x480, выполненного по технологии TFT, предоставляет возможность пользователю комфортно просматривать интернет-страницы, читать электронные книги и смотреть медиаконтент без потери качества изображения и цветопередачи.",
      "price": 5000,
      "image": "https://cdn1.ozone.ru/s3/multimedia-1/wc1200/6273969685.jpg",
      "storage": "32",
      "color": "blue",
      "id": 10
    },
    {
      "name": "iphone 11",
      "desc": "Функциональный и стильный смартфон Apple iPhone 11 в металлическом корпусе способен обеспечить не только повседневное общение и развлечения, но и продуктивную работу. Для этого он оснащен мощным процессором Apple A13 Bionic из 6 ядер, поддерживающим слаженную работу всех комплектующих, а также модулем ОЗУ объемом в 4 ГБ, что предусматривает быстрое переключение между открытыми приложениями и возможность играть в игры. Основная (12;12 Мп) и фронтальная (12 Мп) камеры позволят создавать фотошедевры. Изображение на экране смартфона Apple iPhone 11 диагональю 6.1 дюйма обладает поразительной детализацией и цветопередачей. Олеофобное покрытие исключает сильное загрязнение экрана. Корпус смартфона имеет высокую степень пылевлагозащиты (IP68), благодаря чему обеспечивается эффективная и длительная работа устройства. Несъемный аккумулятор емкостью 3110 мА·ч поддерживает беспроводную зарядку, что сделает данный процесс более легким и быстрым.",
      "price": 65000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5228682/img_id2097358061791733430.png/orig",
      "storage": "128",
      "color": "red",
      "id": 11
    },
    {
      "name": "Iphone 13",
      "desc": "Наша самая совершенная система двух камер. Особый взгляд на прочность дисплея. Чип, с которым всё супербыстро. Аккумулятор держится заметно дольше. iPhone 13 - сильный мира всего. Мы разработали совершенно новую схему расположения и развернули объективы на 45 градусов. Благодаря этому внутри корпуса поместилась наша лучшая система двух камер с увеличенной матрицей широкоугольной камеры. Кроме того, мы освободили место для системы оптической стабилизации изображения сдвигом матрицы. И повысили скорость работы матрицы на сверхширокоугольной камере. Новая сверхширокоугольная камера видит больше деталей в тёмных областях снимков. Новая широкоугольная камера улавливает на 47% больше света для более качественных фотографий и видео. Новая оптическая стабилизация со сдвигом матрицы обеспечит чёткие кадры даже в неустойчивом положении. Режим «Киноэффект» автоматически добавляет великолепные эффекты перемещения фокуса и изменения резкости. Просто начните запись видео. Режим «Киноэффект» будет удерживать фокус на объекте съёмки, создавая красивый эффект размытия вокруг него. Режим «Киноэффект» распознаёт, когда нужно перевести фокус на другого человека или объект, который появился в кадре. Теперь ваши видео будут смотреться как настоящее кино. Хотите переместить фокус или добавить эффект художественного размытия по окончании съёмки? Не проблема. С iPhone для этого достаточно нескольких касаний. На такое способны даже не все профессиональные кинокамеры. Дисплей OLED стал на 28% ярче — до 800 кд/﻿м². На нём всё хорошо видно даже в самый солнечный день. А яркость при просмотре контента в HDR достигает 1200 кд/﻿м². Вы сможете различить мельчайшие оттенки чёрного и белого — как и всех остальных цветов. При этом дисплей расходует заряд аккумулятора ещё более экономно, чем прежде. Дисплей Super Retina XDR отличается невероятно высокой плотностью пикселей — фотографии, видео и текст выглядят поразительно чётко. А благодаря уменьшенной площади камеры TrueDepth на дисплее теперь больше места для изображения. iPhone 13 работает от аккумулятора до 2,5 часов дольше. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, невероятно надёжной технологии аутентификации. Сверхбыстрый чип A15 Bionic обеспечивает работу режима «Киноэффект», фотографических стилей и других функций. Secure Enclave защищает персональные данные, в том числе Face ID и контакты. А ещё новый чип увеличивает время работы от аккумулятора. Скорость работы процессора до 50% выше, чем у многих других смартфонов Обработка графики до 30% быстрее, чем у многих других смартфонов.",
      "price": 92000,
      "image": "https://avatars.mds.yandex.net/get-mpic/5277279/img_id5047394000049844004.jpeg/orig",
      "storage": "256",
      "color": "pink",
      "id": 12
    },
    {
      "name": "Xiaomi POCO X3 Pro",
      "desc": "Компания Xiaomi вновь предоставляет вам возможность насладиться «топовым» железом по самой заманчивой цене. Сверхбыстрый процессор Snapdragon 860 с быстрой памятью UFS 3.1 и ёмким аккумулятором 5160 мАч, цветной IPS-экран с частотой 120 Гц - всё это про РОСО Х3 Pro. Сплошное удовольствие через экран  В смартфоне РОСО Х3 Pro установлен 6,67-дюймовый IPS LCD экран с частотой обновления 120 Гц, а также частотой дискретизации касания 240 Гц - что может быть лучше для суперплавного гейминга и быстрой работы с интерфейсом. Также экран защищён стеклом Corning Gorilla Glass 6, что в дополнение к его скорости отзывчивости добавляет ещё и устойчивости к повреждениям.  Камера для съёмки со вкусом  Основная камера состоит из 4 объективов: широкоугольной 48 МП широкоугольный, ультраширокоугольной 8 МП с углом обзора 119 градусов, макро- и глубины 2 МП. Дополняйте съёмку различными эффектами и делайте фотографии и видео ещё более оригинальными и запоминающимися. Вы можете воспользоваться одновременной съёмкой на обе камеры, таймпласом, панорамой, клонированием и другими функциями для украшения картинки.  Быстрая производительность на долгие годы  РОСО Х3 Pro оснащён новейшим оперативным процессором Qualcomm Snapdragon 860, благодаря которому на смартфоне можно с комфортом играть во все современные игры любого объёма графики и памяти. А запаса мощности чипсета 855/860 может хватит на 3-4 года работы.  Заряд на весь день  В РОСО Х3 Pro установлена батарея ёмкостью 5160 мАч, которая поддерживает быструю зарядку. Вы можете сутки неотрывно заниматься своими делами -  работать, играть или просматривать контент, а потом зарядить смартфон на все 100% всего за 1 час.",
      "price": 30000,
      "image": "https://avatars.mds.yandex.net/get-mpic/4343059/img_id1117171784119993160.jpeg/orig",
      "storage": "128",
      "color": "blue",
      "id": 13
    },
    {
      "name": "Xiaomi POCO M3 Pro 5G",
      "desc": "Уникальный дизайн серии POCO, тройная камера, качественный экран FHD+ IPS с частотой обновления 90 Гц, возможность бесконтактных платежей NFC, IR Blaster для управления устройствами - все это делает смартфон POCO M3 PRO лучшим вариантом для тех, кто ищет мощный и надёжный аппарат на каждый день. Потрясающий экран  POCO M3 Pro оснащён экраном с IPS-матрицей и диагональю 6.5 дюйма. Он поддерживает частоту обновления 90 Гц, что не сможет не порадовать тех, кто ценят плавность интерфейса.  Мощи хватит на всё  Передовой процессор MediaTek Dimensity 700 в сочетании со скоростной сетью 5G будут дарить вам непрерывное удовольствие от любых игр, а также возможность полноценно пользоваться всеми повседневными приложениями на протяжении долгих часов.  Заряжает на полную эффективность  Ёмкость батареи PОСО M3 Pro на 5000 мАч при 60 ГЦ в режиме использования интернета, мессенджеров и потоковой музыки может легко обеспечить вам полтора-два дня автономной работы.  Умные технологии  Кроме NFC, PОСО M3 Pro также может предложить к вашим услугам IR-передатчик для управления бытовой техникой. При разговоре по телефону можно при желании использовать проводную гарнитуру через разъём 3.5 мм.",
      "price": 23000,
      "image": "https://avatars.mds.yandex.net/get-mpic/4937511/img_id2895419192870860511.jpeg/orig",
      "storage": "64",
      "color": "black",
      "id": 14
    },
    {
      "name": "Samsung Galaxy S21 5G",
      "desc": "Samsung Galaxy S21 - создан, чтобы быть в центре событий и внимания. Снимайте потрясающие фото и видео 8К, а также делайте невероятно четкие фотографии в разрешении 33 Мп прямо с отснятого видео. Революционная камера 64 Мп с ИИ анализирует любой кадр, чтобы автоматически сделать его идеальным. Самый быстрый процессор и мощная батарея с зарядом на целый день позволят вам чувствовать себя свободно в любой ситуации. Прочувствуйте события на экране, как если бы вы вживую находились в их эпицентре. Оцените все преимущества технологии Dynamic AMOLED 2Х на суперплавном 120 Гц 6.2–дюймовом экране с потрясающей цветопередачей и четкостью даже на ярком солнце. Оптимизированная частота обновления в зависимости от контента обеспечивает максимум эмоций, снижение вредного воздействия синего света уменьшает напряжение глаз и позволяет наслаждаться просмотром как угодно долго.",
      "price": 81000,
      "image": "https://avatars.mds.yandex.net/get-mpic/4380539/img_id7341649431705533527.jpeg/orig",
      "storage": "128",
      "color": "black",
      "id": 15
    }
  ]
}